/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_ft.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kyamanak <kyamanak@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/08/11 10:59:47 by kyamanak          #+#    #+#             */
/*   Updated: 2025/08/11 11:23:04 by kyamanak         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <unistd.h>

void	ft_ft(int *nbr) //住所を受け取る
{
	*nbr = 42; //その住所の家に行って、中身を42に変える
}

int	main(void)
{
	int	nbr; //家を建てる　nbr=家そのもの（値）　&nbr=家の住所（アドレス）

	nbr = 42;

	ft_ft(&nbr); //私の家の住所は〇〇ですと教える
}

