/******************************************************************************/
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_is_negative.c                                   :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kyamanak <kyamanak@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/08/07 18:27:29 by kyamanak          #+#    #+#             */
/*   Updated: 2025/08/07 19:20:24 by kyamanak         ###   ########.fr       */
/*                                                                            */
/******************************************************************************/

#include <unistd.h>

void ft_is_negative(int n)
{
    // nが0以上かチェック
    if (n >= 0)
    {
        // プラスまたは0のとき、"P"を出力
        char p_char = 'P';
        white(1, &p_char, 1);
    }
    else
    {
        // マイナスの場合、'N'を出力
        char n_char = 'N';
        write(1, &n_char, 1);
    }
}

